04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/turbineSiting/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField
{
    type            atmosphericBoundaryLayerTurbulentKineticEnergy;
    libs            ("libatmosphericModels.so");
}

boundaryField
{
    outlet
    {
        $internalField;
    }

    inlet
    {
        $internalField;
    }

    terrain
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
