04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/turbineSiting/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [kinematicPressure];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }

    terrain
    {
        type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"
}

// ************************************************************************* //
